%skip(Unix only) platform: windows

===
bash shell tests pass
===
cctr $CCTR_FIXTURE_DIR/tests/bash.txt --no-color 2>&1 | tail -1
---
All 4 tests passed in {{ t }}s
---
where
* t: number

===
sh shell tests pass
===
cctr $CCTR_FIXTURE_DIR/tests/sh.txt --no-color 2>&1 | tail -1
---
All 2 tests passed in {{ t }}s
---
where
* t: number

===
file level shell tests pass
===
cctr $CCTR_FIXTURE_DIR/tests/file_level.txt --no-color 2>&1 | tail -1
---
All 2 tests passed in {{ t }}s
---
where
* t: number

===
shell override tests pass
===
cctr $CCTR_FIXTURE_DIR/tests/override.txt --no-color 2>&1 | tail -1
---
All 2 tests passed in {{ t }}s
---
where
* t: number

===
cmd multiline warning appears in verbose output
===
cctr $CCTR_FIXTURE_DIR/cmd_warning --no-color -v 2>&1 | grep -c "Warning.*cmd.exe does not support multi-line"
---
1

===
cmd multiline warning appears in failure output
===
cctr $CCTR_FIXTURE_DIR/cmd_warning --no-color 2>&1 | grep "Warning.*cmd.exe does not support multi-line"
---
  âš  Warning: cmd.exe does not support multi-line commands; only the first line will execute
