===
and both true
===
echo "value: 50"
---
value: {{ n }}
---
where
* n > 0 and n < 100

===
or first true
===
echo "value: 5"
---
value: {{ n }}
---
where
* n < 10 or n > 100

===
or second true
===
echo "value: 200"
---
value: {{ n }}
---
where
* n < 10 or n > 100

===
not
===
echo "value: 50"
---
value: {{ n }}
---
where
* not (n < 0)
* not (n > 100)

===
complex boolean
===
echo "value: 25"
---
value: {{ n }}
---
where
* (n > 10 and n < 30) or n == 100
* not (n < 0 or n > 50)

===
and or precedence
===
echo "value: 5"
---
value: {{ n }}
---
where
* n < 10 or n > 20 and n < 30

===
nested not
===
echo "value: 42"
---
value: {{ n }}
---
where
* not not (n == 42)

===
boolean with comparison chain
===
echo "x: 10 y: 20"
---
x: {{ x }} y: {{ y }}
---
where
* x < y and y > x
* not (x > y) and not (y < x)
